/**
 * 문제 제목: 임시반장 정하기
 * 출처: 자바스크립트 알고리즘 문제풀이
 * 난이도: 배열탐색
 * 문제 링크:
 *
 * 문제 설명:
 * 김갑동 선생님은 올해 6학년 1반 담임을 맡게 되었습니다.
 * 김갑동 선생님은 우선 임시로 반장을 정하고 학생들이 서로 친숙해진 후에
 * 정식으로 선거를 통해 반장을 선출하려고 합니다.
 * 
 * 그는 자기반 학생 중에서 1학년부터 5학년까지 지내오면서 한번이라도 같은 반이었던
 * 사람이 가장 많은 학생을 임시 반장으로 정하려 합니다.
 * 
 * 그래서 김갑동 선생님은 각 학생들이 1학년부터 5학년까지 몇 반에 속했었는지를
 * 나타내는 표를 만들었습니다.
 * 
 * 예를 들어 학생 수가 5명일 때를 살펴보고, 김갑동 선생님이 임시반장으로 정해야 할
 * 학생은 4번 학생입니다. 왜냐하면, 4번 학생은 2번 학생과 2학년 때 같은 반이었고,
 * 3번 학생과는 3학년 때 같은 반이었으며, 5번 학생과는 4학년 때 같은 반이었습니다.
 * 그러므로 이 학급에서 4번 학생과 한번이라도 같은 반이었던 학생은 2, 3, 5번으로
 * 모두 3명입니다.
 *
 * 입력:
 * 첫째 줄에는 반의 학생 수를 나타내는 정수가 주어진다. (N<=1000)
 * 둘째 줄부터 각 학생이 1학년부터 5학년까지 속했던 반이 순서대로 주어진다.
 * 
 * 출력:
 * 첫 줄에 임시 반장으로 정해진 학생의 번호를 출력한다.
 * 단, 임시 반장이 될 수 있는 학생이 여러 명인 경우에는 그 중 가장 작은 번호만 출력한다.
 *
 * 예제:
 * Input: [
 *   [2, 3, 1, 7, 3],
 *   [4, 1, 9, 6, 8],
 *   [5, 5, 2, 4, 4],
 *   [6, 5, 2, 6, 7],
 *   [8, 4, 2, 2, 2]
 * ]
 * Output: 4
 * (4번 학생이 2,3,5번 학생과 같은 반이었던 적이 있어서 3명으로 최대)
 */

/**
 * 시간 복잡도: O()
 * 공간 복잡도: O()
 *
 * 접근 방법:
 * 1.
 * 2.
 * 3.
 */

export function solution(students) {
  // 코드 작성
}

// 테스트 케이스
if (import.meta.url === `file://${process.argv[1]}`) {
  console.log(solution([
    [2, 3, 1, 7, 3],
    [4, 1, 9, 6, 8],
    [5, 5, 2, 4, 4],
    [6, 5, 2, 6, 7],
    [8, 4, 2, 2, 2]
  ])); // 예상 출력: 4
}

